app/controllers/posts_controller.rb

	def create
		#render plain: params[:post].inspect
		@post = Post.new(post_params)

		if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Post1"], ["body", "hello"], ["created_at", "2021-12-20 15:29:12.495885"], ["updated_at", "2021-12-20 15:29:12.495885"]]